//=================================================
//
//オンライン利用技術～スレッド～[main.cpp]
//Author:KishimotoEiji
//
//=================================================
//*******************************
//インクルード
//*******************************
#include <stdio.h>
#include <thread>

//*******************************
//定数の定義
//*******************************
namespace
{
const int MAX_COUNT = 10;	//カウントの最大数
}//namespaceはここまで

//=================================================
//スレッドプロシージャ
//=================================================
void ThreadProc()
{
	for (int i = 0; i < MAX_COUNT; i++)
	{
		printf("\n [ カウント : %d ]", i);	//表示
		std::this_thread::sleep_for(std::chrono::milliseconds(1000));
	}
}

//=================================================
//メイン関数
//=================================================
int main()
{
	//スレッドの作成
	std::thread th(ThreadProc);

	//スレッドの終了を待つ
	th.join();

	//Enter入力待ち
	printf("\n\n Press Enter");
	rewind(stdin);
	getchar();

	return 0;
}